# Importing Csv Files

## Quick Summary
## What are major import topics features?
### 1. pd.read_excel()
### 2. index_col = 0
### 3. header = 1
### 4. usecols = "A:C"

In [3]:
import pandas as pd

In [16]:
sales = pd.read_excel("sales.xls")

In [17]:
sales

  Unnamed: 0      City Country  Sales  Bonus
0       Mike  New York     USA     25   2.50
1        Jim    Boston     USA     43   4.30
2     Steven    London      UK     76   7.60
3        Joe    Madrid   Spain     12   1.80
4        Tom     Paris  France     89  13.35

In [6]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      object
 1   City        5 non-null      object
 2   Country     5 non-null      object
 3   Sales       5 non-null      int64
 4   Bonus       5 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

In [20]:
pd.read_excel("sales.xls", index_col = 0)

            City Country  Sales  Bonus
Mike    New York     USA     25   2.50
Jim       Boston     USA     43   4.30
Steven    London      UK     76   7.60
Joe       Madrid   Spain     12   1.80
Tom        Paris  France     89  13.35

In [8]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      object
 1   City        5 non-null      object
 2   Country     5 non-null      object
 3   Sales       5 non-null      int64
 4   Bonus       5 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

In [10]:
pd.read_excel("sales.xls", index_col = 0, header=1)

       New York     USA  25    2.5
Mike
Jim      Boston     USA  43   4.30
Steven   London      UK  76   7.60
Joe      Madrid   Spain  12   1.80
Tom       Paris  France  89  13.35

In [21]:
pd.read_excel("sales.xls", index_col = 0, header=None)

               1        2      3      4
0
NaN         City  Country  Sales  Bonus
Mike    New York      USA     25    2.5
Jim       Boston      USA     43    4.3
Steven    London       UK     76    7.6
Joe       Madrid    Spain     12    1.8
Tom        Paris   France     89  13.35

In [22]:
pd.read_excel("sales.xls", index_col = 0, header=0, names=["Name","Loc_City","Loc_Country","Revenue","Add_Comp"])

        Loc_City Loc_Country  Revenue  Add_Comp
Name
Mike    New York         USA       25      2.50
Jim       Boston         USA       43      4.30
Steven    London          UK       76      7.60
Joe       Madrid       Spain       12      1.80
Tom        Paris      France       89     13.35

usecols "A:C" means the col labels in excel.

In [26]:
pd.read_excel("sales.xls", index_col = 0, header=0, usecols = "A:c")

            City Country
Mike    New York     USA
Jim       Boston     USA
Steven    London      UK
Joe       Madrid   Spain
Tom        Paris  France

In [25]:
pd.read_excel("sales.xls", index_col = 0, header=0, usecols = "C:E")

         Sales  Bonus
Country
USA         25   2.50
USA         43   4.30
UK          76   7.60
Spain       12   1.80
France      89  13.35

In [29]:
pd.read_excel("sales.xls", index_col = 0, header=0, usecols = ":C")

            City Country
Mike    New York     USA
Jim       Boston     USA
Steven    London      UK
Joe       Madrid   Spain
Tom        Paris  France

Hata Verir

In [28]:
pd.read_excel("sales.xls", index_col = 0, header=0, usecols = "C:")

IndexError: list index out of range

In [30]:
pd.read_excel("sales.xls", index_col = 0, header=0, usecols = [0,3,4])

        Sales  Bonus
Mike       25   2.50
Jim        43   4.30
Steven     76   7.60
Joe        12   1.80
Tom        89  13.35